###############################################################################
# Created by write_sdc
###############################################################################
current_design FP32_Div
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 50.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expa[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {expb[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaA[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[0]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[10]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[11]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[12]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[13]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[14]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[15]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[16]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[17]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[18]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[19]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[1]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[20]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[21]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[22]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[2]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[3]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[4]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[5]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[6]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[7]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[8]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisaB[9]}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {signa}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {signb}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {exp[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[10]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[11]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[12]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[13]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[14]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[15]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[16]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[17]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[18]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[19]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[20]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[21]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[22]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[8]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {mantisa[9]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sign}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {sign}]
set_load -pin_load 0.0334 [get_ports {exp[7]}]
set_load -pin_load 0.0334 [get_ports {exp[6]}]
set_load -pin_load 0.0334 [get_ports {exp[5]}]
set_load -pin_load 0.0334 [get_ports {exp[4]}]
set_load -pin_load 0.0334 [get_ports {exp[3]}]
set_load -pin_load 0.0334 [get_ports {exp[2]}]
set_load -pin_load 0.0334 [get_ports {exp[1]}]
set_load -pin_load 0.0334 [get_ports {exp[0]}]
set_load -pin_load 0.0334 [get_ports {mantisa[22]}]
set_load -pin_load 0.0334 [get_ports {mantisa[21]}]
set_load -pin_load 0.0334 [get_ports {mantisa[20]}]
set_load -pin_load 0.0334 [get_ports {mantisa[19]}]
set_load -pin_load 0.0334 [get_ports {mantisa[18]}]
set_load -pin_load 0.0334 [get_ports {mantisa[17]}]
set_load -pin_load 0.0334 [get_ports {mantisa[16]}]
set_load -pin_load 0.0334 [get_ports {mantisa[15]}]
set_load -pin_load 0.0334 [get_ports {mantisa[14]}]
set_load -pin_load 0.0334 [get_ports {mantisa[13]}]
set_load -pin_load 0.0334 [get_ports {mantisa[12]}]
set_load -pin_load 0.0334 [get_ports {mantisa[11]}]
set_load -pin_load 0.0334 [get_ports {mantisa[10]}]
set_load -pin_load 0.0334 [get_ports {mantisa[9]}]
set_load -pin_load 0.0334 [get_ports {mantisa[8]}]
set_load -pin_load 0.0334 [get_ports {mantisa[7]}]
set_load -pin_load 0.0334 [get_ports {mantisa[6]}]
set_load -pin_load 0.0334 [get_ports {mantisa[5]}]
set_load -pin_load 0.0334 [get_ports {mantisa[4]}]
set_load -pin_load 0.0334 [get_ports {mantisa[3]}]
set_load -pin_load 0.0334 [get_ports {mantisa[2]}]
set_load -pin_load 0.0334 [get_ports {mantisa[1]}]
set_load -pin_load 0.0334 [get_ports {mantisa[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {signa}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {signb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expa[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {expb[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mantisaB[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
