###############################################################################
# Created by write_sdc
###############################################################################
current_design Reorder_buffer
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {control[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {control[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable_write[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable_write[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enable_write[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value0[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value1[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value2[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {value[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location0[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location0[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location0[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location0[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location1[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location1[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location1[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location1[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location2[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location2[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location2[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {write_location2[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_location[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_location[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_location[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_location[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {success}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {success}]
set_load -pin_load 0.0334 [get_ports {data_location[3]}]
set_load -pin_load 0.0334 [get_ports {data_location[2]}]
set_load -pin_load 0.0334 [get_ports {data_location[1]}]
set_load -pin_load 0.0334 [get_ports {data_location[0]}]
set_load -pin_load 0.0334 [get_ports {out[31]}]
set_load -pin_load 0.0334 [get_ports {out[30]}]
set_load -pin_load 0.0334 [get_ports {out[29]}]
set_load -pin_load 0.0334 [get_ports {out[28]}]
set_load -pin_load 0.0334 [get_ports {out[27]}]
set_load -pin_load 0.0334 [get_ports {out[26]}]
set_load -pin_load 0.0334 [get_ports {out[25]}]
set_load -pin_load 0.0334 [get_ports {out[24]}]
set_load -pin_load 0.0334 [get_ports {out[23]}]
set_load -pin_load 0.0334 [get_ports {out[22]}]
set_load -pin_load 0.0334 [get_ports {out[21]}]
set_load -pin_load 0.0334 [get_ports {out[20]}]
set_load -pin_load 0.0334 [get_ports {out[19]}]
set_load -pin_load 0.0334 [get_ports {out[18]}]
set_load -pin_load 0.0334 [get_ports {out[17]}]
set_load -pin_load 0.0334 [get_ports {out[16]}]
set_load -pin_load 0.0334 [get_ports {out[15]}]
set_load -pin_load 0.0334 [get_ports {out[14]}]
set_load -pin_load 0.0334 [get_ports {out[13]}]
set_load -pin_load 0.0334 [get_ports {out[12]}]
set_load -pin_load 0.0334 [get_ports {out[11]}]
set_load -pin_load 0.0334 [get_ports {out[10]}]
set_load -pin_load 0.0334 [get_ports {out[9]}]
set_load -pin_load 0.0334 [get_ports {out[8]}]
set_load -pin_load 0.0334 [get_ports {out[7]}]
set_load -pin_load 0.0334 [get_ports {out[6]}]
set_load -pin_load 0.0334 [get_ports {out[5]}]
set_load -pin_load 0.0334 [get_ports {out[4]}]
set_load -pin_load 0.0334 [get_ports {out[3]}]
set_load -pin_load 0.0334 [get_ports {out[2]}]
set_load -pin_load 0.0334 [get_ports {out[1]}]
set_load -pin_load 0.0334 [get_ports {out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {control[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {control[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable_write[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable_write[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enable_write[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {value2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location1[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location1[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location1[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location2[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location2[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location2[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {write_location2[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
